tap 'homebrew/bundle'

brew 'agg'
brew 'asciinema'
brew 'atuin'
brew 'bat'
brew 'btop'
brew 'fblog'
brew 'caddy'
brew 'cmake'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'dive'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'docker-credential-helper'
brew 'editorconfig'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fontconfig'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'git-lfs'
brew 'gnupg'
brew 'gpgme'
brew 'graphicsmagick'
brew 'grep'
brew 'helix'
brew 'hyperfine'
brew 'imagemagick'
brew 'jq'
brew 'lazydocker'
brew 'libffi'
brew 'libiconv'
brew 'libyaml'
brew 'lnav'
brew 'mas'
brew 'mergiraf'
brew 'mosh'
brew 'neovim'
brew 'nss'
brew 'nushell'
brew 'pinentry-mac'
brew 'pkg-config'
brew 'ripgrep'
brew 'skopeo'
brew 'sqlite'
brew 'tree'
brew 'wget'
brew 'xcodes'
brew 'zlib'

# Casks
cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'balenaetcher'
cask 'claude'
cask 'elgato-control-center'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'font-inter'
cask 'font-symbols-only-nerd-font'
cask 'ghostty'
cask 'gitbutler'
cask 'google-chrome'
cask 'handbrake-app'
cask 'httpie-desktop'
cask 'iina'
cask 'imageoptim'
cask 'keka'
cask 'keycastr'
cask 'linearmouse'
cask 'lm-studio'
cask 'localsend'
cask 'obsidian'
cask 'pika'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'raycast'
cask 'sanesidebuttons'
cask 'slack'
cask 'virtualbuddy'
cask 'visual-studio-code'
cask 'zen'
cask 'zoom'

mas 'Amphetamine', id: 937984704
mas '1Password for Safari', id: 1_569_813_296
mas 'Gapplin', id: 768_053_424
mas 'JSON Helper', id: 453_114_608
mas 'Keynote', id: 409_183_694
mas 'Numbers', id: 409_203_825
mas 'Pages', id: 409_201_541
mas 'Velja', id: 1_607_635_845
mas 'Xcode', id: 497799835

tap 'tw93/tap', 'https://github.com/tw93/homebrew-tap'
brew 'mole'

{{- if not .workconf }}
brew 'railway'

cask 'acorn'
cask 'brave-browser'
cask 'chatgpt'
cask 'cleanshot'
cask 'daisydisk'
cask 'discord'
cask 'fork'
cask 'jetbrains-toolbox'
cask 'little-snitch'
cask 'monodraw'
cask 'netnewswire'
cask 'nvidia-geforce-now'
cask 'obs'
cask 'prismlauncher'
cask 'protonvpn'
cask 'qbittorrent'
cask 'signal'
cask 'spotify'
cask 'sublime-merge'
cask 'telegram'
cask 'todoist-app'
cask 'zed@preview'

mas 'Agenda', id: 1287445660
mas 'Consent-O-Matic', id: 1606897889
mas 'Dynamo', id: 1445910651
mas 'Flighty', id: 1358823008
mas 'HP', id: 1474276998
mas 'Hush', id: 1544743900
mas 'Ivory', id: 6444602274
mas 'Kagi for Safari', id: 1622835804
mas 'Keepa - Price Tracker', id: 1533805339
mas 'Noir', id: 1592917505
mas 'Parcel', id: 375589283
mas 'PiPifier', id: 1160374471
mas 'TestFlight', id: 899247664
mas 'WhatsApp', id: 310633997
mas 'Wipr', id: 1662217862

{{- else }}
tap 'fforster/gitlab-mcp', 'https://gitlab.com/fforster/homebrew-gitlab-mcp.git'
tap 'gitlab/fonts', 'https://gitlab.com/vitallium/homebrew-gitlab-fonts'

brew 'bash' # for runbooks repo
brew 'exiftool'
brew 'gitlab-mcp'
brew 'glab'
brew 'graphviz'
brew 'librsvg'
brew 'meson'
brew 'nginx'
brew 'ninja'
brew 'runit'
brew 'teleport'

cask 'bruno'
cask 'cap'
cask 'figma'
cask 'font-gitlab-mono-italic'
cask 'font-gitlab-mono-regular'
cask 'font-gitlab-sans-italic'
cask 'font-gitlab-sans-regular'
cask 'fsnotes'
cask 'gcloud-cli'
cask 'goland'
cask 'handy'
cask 'pycharm'
cask 'rubymine'
cask 'shottr'
cask 'vagrant'
cask 'zed'

{{- end }}
