tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "openssl@1.1"
brew "bat"
brew "cmake"
brew "gmp"
brew "readline"
brew "gnutls"
brew "colima"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-compose"
brew "python@3.10"
brew "docutils"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gitleaks"
brew "gnu-getopt"
brew "gnupg"
brew "gpgme"
brew "graphicsmagick"
brew "hopenpgp-tools"
brew "imagemagick"
brew "jq"
brew "languagetool"
brew "lazygit"
brew "libgccjit"
brew "libiconv"
brew "libvterm"
brew "libyaml"
brew "mas"
brew "neovim"
brew "ossp-uuid"
brew "pinentry-mac"
brew "re2"
brew "ripgrep"
brew "ripsecrets"
brew "runit"
brew "shellcheck"
brew "shfmt"
brew "subversion"
brew "teleport"
brew "tmux"
brew "tree"
brew "vale"
brew "vault"
brew "watchexec"
brew "wget"
brew "yamllint"
brew "ykman"
brew "ykpers"
brew "zlib"
cask "1password"
cask "1password-cli"
cask "acorn"
cask "bartender"
cask "brave-browser"
cask "chromedriver"
cask "discord"
cask "figma"
cask "firefox"
cask "font-iosevka-etoile"
cask "google-chrome"
cask "handbrake"
cask "iina"
cask "kaleidoscope"
cask "keycastr"
cask "kitty"
cask "little-snitch"
cask "mimestream"
cask "mouse-fix"
cask "obs"
cask "openinterminal"
cask "protonvpn"
cask "qbittorrent"
cask "qlmarkdown"
cask "quicklook-json"
cask "rancher"
cask "rapidapi"
cask "raycast"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "telegram"
cask "via"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Gapplin", id: 768053424
mas "JSON Helper", id: 453114608
mas "Keynote", id: 409183694
mas "LanguageTool", id: 1534275760
mas "Location Helper", id: 488536386
mas "Magnet", id: 441258766
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Outline", id: 1356178125
mas "Pages", id: 409201541
mas "Velja", id: 1607635845
mas "Vimari", id: 1480933944
mas "Webcam Settings", id: 533696630
mas "Wipr", id: 1320666476
