decors/fish-colored-man
franciscolourenco/done
joehillen/to-fish
laughedelic/pisces
oh-my-fish/plugin-license
tuvistavie/fish-ssh-agent
edc/bass
oh-my-fish/plugin-foreign-env
mattgreen/lucid.fish
jorgebucaran/fisher
jethrokuan/fzf
dracula/fish
