decors/fish-colored-man
fishpkg/fish-git-util
franciscolourenco/done
jethrokuan/fzf
joehillen/to-fish
laughedelic/pisces
oh-my-fish/plugin-license
rafaelrinaldi/pure
tuvistavie/fish-ssh-agent
edc/bass
oh-my-fish/plugin-direnv
jorgebucaran/fisher
